---
kind: property
id: P:Autodesk.Revit.DB.DirectContext3D.Camera.ViewDirection
source: html/d0770725-ebf6-25e8-25c6-fca07fb1516c.htm
---
# Autodesk.Revit.DB.DirectContext3D.Camera.ViewDirection Property

Direction that the camera is facing

## Syntax (C#)
```csharp
public XYZ ViewDirection { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null